# Visualization Project on the top 100 Subscribed Channels on Youtube

## Import Libraries

In [23]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Load Dataset

In [24]:
ytdf = pd.read_csv("Datasets/top channels.csv")

## Data Preparation

### Renaming the necessary columns

In [25]:
ytdf.rename(columns={"Video Count":"Upload Count"},inplace=True)

In [26]:
ytdf.head(3)

,Rank,Youtube Channel,Subscribers,Video Views,Upload Count,Category,Started
0,1,T-Series,"234,000,000","212,900,271,553","18,515",Music,2006
1,2,YouTube Movies,"161,000,000",0,0,Film & Animation,2015
2,3,Cocomelon - Nursery Rhymes,"152,000,000","149,084,178,448",846,Education,2006

### Head of the data

In [27]:
ytdf.head(3)

,Rank,Youtube Channel,Subscribers,Video Views,Upload Count,Category,Started
0,1,T-Series,"234,000,000","212,900,271,553","18,515",Music,2006
1,2,YouTube Movies,"161,000,000",0,0,Film & Animation,2015
2,3,Cocomelon - Nursery Rhymes,"152,000,000","149,084,178,448",846,Education,2006

### About

**Youtube Founded** - 14 February 2005

> **Rank** - Overall rank of the channel out of the lot

> **Youtube Channel** - Channel Name

> **Subscribers** - Subscriber Count

> **Video Views** - Overall views generated in the channel

> **Video Count** - Number of videos uploaded in the channel

> **Category** - Which category does the channel belong to ?

> **Started** - When was the created on youtube

In [28]:
ytdf.shape

(1000, 7)

### Use the Info() to get an idea about datatypes,dimensions etc

In [29]:
ytdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Rank             1000 non-null   int64
 1   Youtube Channel  1000 non-null   object
 2   Subscribers      1000 non-null   object
 3   Video Views      1000 non-null   object
 4   Upload Count     1000 non-null   object
 5   Category         1000 non-null   object
 6   Started          1000 non-null   int64
dtypes: int64(2), object(5)
memory usage: 54.8+ KB

### Describe() to get the statistical information

In [34]:
ytdf.describe()

              Rank      Started
count  1000.000000  1000.000000
mean    500.500000  2012.594000
std     288.819436     4.110238
min       1.000000  1970.000000
25%     250.750000  2010.000000
50%     500.500000  2013.000000
75%     750.250000  2015.000000
max    1000.000000  2021.000000

In [36]:
ytdf.tail(5)

,Rank,Youtube Channel,Subscribers,Video Views,Upload Count,Category,Started
995,996,XO TEAM,"11,500,000","11,471,384,709","2,679",People & Blogs,2021
996,997,Nirahua Music World,"11,500,000","5,997,717,755",788,Music,2014
997,998,YtCrash,"11,400,000","3,825,084",1,Education,2015
998,999,Painzeiro,"11,400,000","2,143,444,281",946,People & Blogs,2015
999,1000,Oum Walid,"11,400,000","2,480,064,722","1,598",People & Blogs,2015

## Data Cleaning

Youtube was founded in 2005. Any values less than 2005 that are added in the **Started** Column should be corrected

### Fix the 'Started' Column with values < 2005

## Visualization